In [1]:
from datasets import load_dataset
import pandas as pd
import matplotlib.pyplot as plt

#load data
dataSet = load_dataset('lukebarousse/data_jobs')
df = dataSet['train'].to_pandas()

#clean data
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

c:\Users\Booheymen\AppData\Local\Programs\Python\Python312\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [2]:
df.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [8]:
median_hour_avg = df['salary_hour_avg'].median()
median_year_avg = df['salary_year_avg'].median()
median_hour_avg,median_year_avg

(45.97999954223633, 115000.0)

## fill emplty column wit values

In [13]:
#fill emplty data in column with median values 
df_filled =  df
df_filled['salary_hour_avg']=df_filled['salary_hour_avg'].fillna(median_hour_avg)
df_filled['salary_year_avg']=df_filled['salary_year_avg'].fillna(median_year_avg)

In [14]:
df_filled.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

## remove empty columns

In [ ]:
#remove duplicates
df_unique = df_filled.drop_duplicates()
print('Original datframe:',len(df_filled))
print('After removing duplicates:',len(df_unique))
print('Duplicates:',len(df_filled)-len(df_unique))

Original datframe: 785741
After removing duplicates: 785640
Duplicates: 101

In [17]:
#remove duplicates by job_title,company_name
df_unique = df_filled.drop_duplicates(subset=['job_title','company_name'])
print('Original datframe:',len(df_filled))
print('After removing duplicates:',len(df_unique))
print('Duplicates:',len(df_filled)-len(df_unique))

Original datframe: 785741
After removing duplicates: 508042
Duplicates: 277699